---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTrayRun
source: html/79410770-b992-fe77-60ed-4a6e688b689a.htm
---
# CableTrayRun Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.